000100* Fixed format copyfile
       01 nieuwdeelnemersRecord.
           05 nieuwDeelnemersLijn            PIC X(200).
           88 eof                            VALUE HIGH-VALUES.