000100* Fixed format copyfile
       01 parameterRecord.
           05 parameterLijn                           PIC X(200).
           88 eof                            VALUE HIGH-VALUES.
